var storage = window.localStorage;


//业务数据获取完毕，并已插入当前页面DOM；
mui.init();
//注意：若为ajax请求，则需将如下代码放在处理完ajax响应数据之后；
mui.plusReady(function() {
	mui.ready(function() {
		var self = plus.webview.currentWebview();
		if(storage["city"] == undefined || storage["city"] == "" || storage["city"] == null){
			document.getElementById("current_city_name").innerText = "当前位置：曲靖";
		}
		else{
			document.getElementById("current_city_name").innerText = "当前位置："+storage["city"];
		}
		
		var obj_lis = document.getElementById("mui-table-view").getElementsByTagName("li");
	    for(i=0;i<obj_lis.length;i++){
	        obj_lis[i].onclick = function(){
	            var city = this.innerHTML;
				storage["city"] = city;
				// 重新加载父页面
			  var view = plus.webview.all();
			  view[view.length - 2].reload(true);
			  // 关闭当前页面
			  plus.webview.close(plus.webview.getTopWebview().id, 'slide-out-right', 500);
	        }
	    }
  	})
	
})

//索引点击事件
function suoyinClick(zimu){
	self.window.location.href = "#"+zimu;
	var a_list = $(".right_nav>a");
	for(var index = 0;index < a_list.length;index++){
		var obj = a_list[index];
		var id = obj.getAttribute('id');
		if(id == zimu){
			obj.style.color = "red";
		}
		else{
			obj.style.color = "#40E0D0";
		}
	}
}


//城市json数据
	function cityJSONDataZZ(tag){
		var cityNameA = new Array("阿拉善盟","鞍山","安庆","安阳","阿坝","安顺","阿里","安康","阿克苏","阿勒泰","澳门","安吉","安丘","安岳","安平",
		"安溪","安宁","安化","阿拉尔","安福","阿勒泰市","阿图什市","安州区","阿荣旗","安陆市","阿城区");
		var cityNameB = new Array("北京","保定","蚌埠","包头","巴彦淖尔","本溪","白山","白城","亳州","滨州","北海","百色","巴中","毕节",
		"保山","宝鸡","白银","博尔塔拉","巴州","滨海","宝应","北流","博爱","北碚","宝丰","博兴","泌阳","彬县","璧山","博山","宾阳",
		"泊头市","博罗县","博白县","北镇市","北安市","巴彦县","巴楚县","拜城县","拜泉县");
		var cityNameC = new Array("重庆","成都","长沙","常州","长春","承德","沧州","长治","赤峰","朝阳","滁州","巢湖","池州","常德",
		"郴州","潮州","崇左","楚雄","昌都","昌吉","从化","常熟","慈溪","长兴","长乐","昌邑","苍南","长葛","崇州","赤壁","淳安","承德县",
		"昌乐","曹妃甸","磁县","长垣","成安","昌黎","岑溪","茌平","曹县","城固","长汀","潮安","长寿","常山","赤水","慈利","常宁市","茶陵",
		"长丰县","苍溪县","长清区","崇明区","成武县","澄江县","澄迈县");
		var cityNameD = new Array("大连","大庆","东莞","大同","丹东","大兴安岭","东营","德州","德阳","达州","大理","德宏","迪庆","定西",
		"丹阳","敦煌","东阳","德清","大丰","东台","当阳","东港","登封","儋州","都江堰","大石桥","大冶","东兴","调兵山","灯塔","邓州","大通",
		"东方","东平","电白","东海","定州","郸城","大荔","达拉特旗","大竹","大洼","大邑","砀山","敦化","东光","道县","大安市","定安县","垫江",
		"东明县","定陶区","定边县","大厂回族自治县","定远县","大悟县","大足区","德惠市","东坑镇");
		var cityNameE = new Array("鄂尔多斯","鄂州","恩施","峨眉山","额尔古纳","恩平","额敏县");
		var cityNameF = new Array("福州","佛山","抚顺","阜新","阜阳","抚州","防城港","富阳","涪陵","福清","凤凰古城","阜宁","奉化","肥城",
		"凤城","汾阳","阜康","丰城","范县","繁昌","肥乡区","封丘","扶风","丰县","抚松","富顺","费县","佛冈","丰宁","扶沟","凤台","奉新","方城",
		"富源县","分宜","扶绥县","肥西县","繁峙县","凤翔县","福安","福鼎市","府谷县","奉节","丰都","肥东县","富民");
		var cityNameG = new Array("广州","桂林","贵阳","赣州","贵港","广元","广安","甘孜","甘南","果洛","固原","高邮","广饶","巩义","桂平",
		"公主岭","高密","广汉","藁城","高平","高碑店","个旧","高州","盖州","古交","格尔木","高雄","灌云","灌南","赣榆","高安","广德","共青城",
		"高阳","高陵","公安","鼓浪屿","固始县","光泽","光山县","固安县");
		var cityNameH = new Array("杭州","合肥","海口","葫芦岛","哈尔滨","邯郸","衡水","呼和浩特","呼伦贝尔","鹤岗","黑河","淮安","湖州","淮南",
		"淮北","黄山","菏泽","鹤壁","黄石","黄冈","衡阳","怀化","惠州","河源","贺州","河池","红河","汉中","海东","海北","黄南","海南州","海西","哈密",
		"和田","海宁","惠东","惠阳","鹤山","桦甸","海城","海门","华阴","海阳","霸州","侯马","河津","海安","霍州","黄骅","化州","海林","花莲","恒春",
		"海盐","合川","淮阳","汉阴","含山","和县","户县","辉县","怀仁","滑县","惠安","韩城","横店","华亭","洪洞","河口","辉南","洪湖","海沧","霍邱","珲春",
		"怀宁","怀远县","会泽县","河间市","合浦县","衡阳县","衡山县","衡东县","潢川县","贺兰县","汉南区","海伦市","合江县","环县","黄陵县","桦川县","横山区","华容");
		var cityNameJ = new Array("济南","焦作","锦州","九江","晋城","晋中","吉林","鸡西","佳木斯","嘉兴","金华","景德镇","吉安","济宁","济源","荆门",
		"荆州","江门","揭阳","金昌","酒泉","江阴","嘉峪关","晋江市","靖江","金坛","九寨沟","井冈山","嘉善","江山","句容","建湖","晋州","胶州","建德","简阳","介休",
		"即墨","集安","基隆","嘉义市","蛟河","建阳","郏县","金堂","监利","江津","巨野","嘉祥","金乡","缙云","京山","江油","莒南","江都","金湖","集美","金沙","泾县","吉安县",
		"吉水县","江川县","江华瑶族自治县","晋宁区","江永","建水县","鄄城县","靖边","嘉鱼县","祁县","精河县","靖西市","景谷","九台","景东彝族自治县");
		var cityNameK = new Array("昆明","开封","克拉玛依","克州","喀什地区","昆山","凯里","开平","库尔勒","奎屯","开州区","垦利","宽城","库车","开化","开阳","康县","垦丁");
		var cityNameL = new Array("廊坊","临汾","吕梁","辽阳","辽源","连云港","丽水","六安","龙岩","莱芜","临沂","聊城","洛阳","漯河","娄底","柳州","来宾","泸州","乐山","凉山",
		"六盘水","丽江","临沧","拉萨","林芝","兰州","陇南","临夏","溧阳","临海","兰溪","龙口","耒阳","乐昌","莱州","临清","临安","莱阳","陆丰","灵宝","冷水江","乐陵","浏阳","龙海",
		"醴陵","莱西","廉江","乐平","阆中","鹿泉","利川","老河口","凌海","滦南","灵山","连州","陵水","临江","连江","临朐","乐亭","滦县","栾城","鲁山","灵石","临漳","临潼","蓝田","林州",
		"隆昌市","鹿邑","柳河","临猗","梁山","利津","临邑","龙泉","陵川","隆尧","雷州","栾川","龙游","兰陵","临沭","涟水","澧县","辽中","罗平县","涟源市","庐江县","临颍","蓝山","隆回",
		"芦溪","卢氏县","隆化县","洛宁","兰考县","临澧","利辛","灵丘县","禄丰县","溧水区","泸县","洛川县","罗定市","乐东","梁平","临高县","罗源县","陆川县","临泉县","禄劝彝族苗族自治县");
		var cityNameM = new Array("牡丹江","马鞍山","茂名","梅州","绵阳","眉山","漠河","密山","满洲里","梅河口","汨罗","明光","麻城","孟州","苗栗","孟津","牟平","眉县","民权","渑池",
		"绵竹","蒙阴","蒙自市","蒙城","勐腊县","米易县","闽侯县","明水县");
		var cityNameN = new Array("宁波","南京","南通","南昌","南宁","南平","宁德","南阳","内江","南充","怒江","那曲","宁海","宁乡","南沙","南安","讷河","南雄","南投","南乐","南陵",
		"宁阳","宁国","宁晋","宁津","内丘","南宫","内黄","南和","南部县","南皮县","宁陵","南郑区","宁蒗彝族自治县","嫩江县","宁远县","南川");
		var cityNameP = new Array("盘锦","莆田","萍乡","平顶山","濮阳","攀枝花","普洱","平凉","邳州","平湖","普宁","平度","彭州","蓬莱","鄱阳","澎湖","浦江","磐石","平原","平潭",
		"沛县","蒲城","盘州市","平江","濮阳县","平山","平泉市","平邑","平舆","平阳","平遥","平果","平罗县","平阴县","平陆县","平昌县","平南县","彭水苗族土家族自治县","普兰店");
		var cityNameQ = new Array("青岛","齐齐哈尔","泉州","秦皇岛","七台河","衢州","清远","钦州","黔西南","黔东南","黔南","曲靖","庆阳","琼海","迁安","青州","启东","潜江",
		"沁阳","邛崃","齐河","清丰","淇县","全椒","栖霞","青田","清河","庆云","潜山","青县","祁东县","庆安县","杞县","青冈县","岐山县","琼中","青阳县","清镇","綦江","清徐","迁西县","企石镇");
		var cityNameR = new Array("日照","日喀则","瑞安","仁怀","荣成","乳山","如皋","汝州","瑞金","瑞昌","仁寿","任丘","汝阳","如东","任县","汝城县","容县","荣昌区","瑞丽");
		var cityNameS = new Array("上海","深圳","沈阳","石家庄","苏州","三亚","汕头","朔州","四平","松原","双鸭山","绥化","宿迁","绍兴凼乡","宿州","上海","深圳","沈阳","石家庄",
		"苏州","三亚","汕头","朔州","四平","松原","双鸭山","绥化","宿迁","绍兴凼乡","宿州","石河子","石狮","上虞","神农架","三清山","寿光","嵊州","沭阳","射阳","三河","韶山","沙河",
		"四会","松滋","舒兰","邵东","睢县","泗阳","沙湾","涉县","神木市","绥中","上高","石泉","泗洪","单县","沈丘","三门","睢宁","上蔡","遂昌","石岛","什邡","上杭","嵩县","舒城",
		"射洪","商河","泗水","社旗","泗县","深州市","上林县","商水县","双峰","遂川","上栗","莎车县","肃宁县","商城县","桑植","石门","鄯善县","绥德县","沙县","深泽县","石柱","邵武",
		"寿县","三台县","山丹县","陕州区","绥宁县","双城","遂平","沙雅","嵩明县","石林彝族自治县");
		var cityNameT = new Array("天津","太原","唐山","通辽","铁岭","通化","泰州","台州","铜陵","泰安","铜仁","铜川","天水","吐鲁番","塔城","台北","桐乡","太仓","腾冲","台山",
		"泰兴","滕州","桐庐","天门","天长","洮南","桐城","台中","台南","台东","桃园","台前","太和","天台","太谷","藤县","汤阴","土默特右旗","郯城","铜梁","同安","桃源","泰和县",
		"铜鼓","田东县","太康县","通许县","通海县","通榆县","唐河","同心县","塔城市","台湾","通江县","通河县","屯昌县");
		var cityNameW = new Array("无锡","武汉","芜湖","温州","乌海","乌兰察布","潍坊","威海","梧州","文山","渭南","武威","吴忠","乌鲁木齐","万州","吴江","武夷山","武安","温岭",
		"婺源","武当山","文登","乌镇","吴川","文昌","武穴","万宁","舞钢","温县","武陟","乌苏","无为","芜湖县","卫辉","乌拉特前旗","微山","汶上","武城","围场","瓦房店","武义","武鸣",
		"威宁","舞阳","无极","万荣","万载","威县","武平县","尉氏县","武隆县","五常市","旺苍县","望奎县","武冈市","武定");
		var cityNameX = new Array("西安","厦门","新乡","香港","徐州","邢台","忻州","兴安盟","锡林郭勒","宣城","新余","许昌","信阳","襄阳","孝感","咸宁","湘潭","湘西","西双版纳",
		"咸阳","西宁","仙桃","香格里拉","兴化","新泰","湘阴","响水","辛集","新沂","新郑","新密","荥阳","西塘","兴宁","新民","项城","孝义","湘乡","兴城","兴平","象山","修武","新北",
		"新竹市","夏津","信宜","新化","仙居","襄垣","宣威","霞浦","新安","新乡县","盱眙","徐闻","夏邑","浚县","西乡","西平","新乐","新昌","薛城","西华","浠水","香河","信丰","新蔡",
		"溆浦","淅川","新干","兴国县","新田","寻乌县","祥云县","襄城县","新宁","献县","新洲区","秀山土家族苗族自治县","新野","仙游县","新津县","旬阳县","孝昌县","息县","萧县","谢岗镇");
		var cityNameY = new Array("烟台","扬州","阳泉","运城","营口","延边","伊春","盐城","鹰潭","宜春","宜昌","岳阳","益阳","永州","阳江","云浮","玉林","宜宾","雅安","玉溪","延安",
		"榆林","玉树","银川","伊犁","义乌","兖州","宜兴","永康","余姚","阳朔","乐清","英德","伊川","仪征","偃师","扬中","永城","永济","禹城","禹州","伊宁","宜城","原平","宜都","沅江",
		"玉环市","宜兰","永川","永年","阳城","云阳","叶县","易县","宜阳","阎良","原阳","虞城","玉山","阳谷","郓城","伊金霍洛旗","杨凌","沂水","沂南","于都","宜丰","营山县","永安","鄢陵",
		"永丰","永新","永兴县","攸县","永顺县","裕民县","酉阳土家族苗族自治县","应县","阳山县","榆树市","沅陵县","永登县","鱼台县","宜州区","义马市","永嘉县","盂县","宜良县","玉田县");
		var cityNameZ = new Array("郑州","淄博","珠海","中山","张家口","镇江","舟山","漳州","枣庄","周口","驻马店","株洲","张家界","湛江","肇庆","自贡","资阳","遵义","昭通","张掖",
		"中卫","张家港","涿州","章丘区","诸暨","枣阳","邹平","诸城","庄河","招远","遵化","钟祥","周庄","枝江","漳浦","樟树","彰化","正定","中牟","邹城","赵县","柘城","准格尔旗","周至",
		"芷江","织金","漳平","资兴市","扎兰屯市","忠县","柘荣","中江县","镇雄县","中宁县");
		
		
		
		if(tag == "A"){
			return cityNameA;
		}
		else if(tag == "B"){
			return cityNameB;
		}
		else if(tag == "C"){
			return cityNameC;
		}
		else if(tag == "D"){
			return cityNameD;
		}
		else if(tag == "E"){
			return cityNameE;
		}
		else if(tag == "F"){
			return cityNameF;
		}
		else if(tag == "G"){
			return cityNameG;
		}
		else if(tag == "H"){
			return cityNameH;
		}
		else if(tag == "J"){
			return cityNameJ;
		}
		else if(tag == "K"){
			return cityNameK;
		}
		else if(tag == "L"){
			return cityNameL;
		}
		else if(tag == "M"){
			return cityNameM;
		}
		else if(tag == "N"){
			return cityNameN;
		}
		else if(tag == "P"){
			return cityNameP;
		}
		else if(tag == "Q"){
			return cityNameQ;
		}
		else if(tag == "R"){
			return cityNameR;
		}
		else if(tag == "S"){
			return cityNameS;
		}
		else if(tag == "T"){
			return cityNameT;
		}
		else if(tag == "W"){
			return cityNameW;
		}
		else if(tag == "X"){
			return cityNameX;
		}
		else if(tag == "Y"){
			return cityNameY;
		}
		else if(tag == "Z"){
			return cityNameZ;
		}
	}